<?php
return array(
		//Api错误码，暂时只搞中文的，有需要再扩展语言包
		'API_ERR_CODE'	=> array(
				'-1'	=> '系统繁忙，请稍候再试',
				'0'		=> '请求成功',
				
				
		
				//综合报错
				'40010'	=> 'token验证失败',
				'40011'	=> '参数错误',
				'40012'	=> '参数缺失',
				'40013'	=> 'appid不存在',
				'40014'	=> 'token超时',
				
				//综合报错
				'49001'	=> '订单号必须',
				'49002'	=> '支付是否成功必须',

				//用户帐号相关
				'40020'	=> '登录失败',
				'40021'	=> '验证码类型必须',
				'40022' => '确认支付密码必须',
				'40023' => '支付密码与确认支付密码不一致',
				'40024' => '支付密码格式错误',


				'40025' => '密码必须',
				'40026' => '新密码必须',
				'40027' => '确认新密码必须',
				'40028' => '新密码与确认新密码不一致',
                                '40029' => '密码格式不正确',
                                '40001' =>'密码与确认新密码不一致',

				'40030'	=> '注册已关闭',
				'40031'	=> '注册验证码错误',
				'40032' => '手机不能为空',
                                '40033' => '邮箱必须',
                                '40034' => '昵称必须',
                                '40035'	=> '验证码必须',
                                '40036'	=> '支付密码必须',
                                '40037'	=> '设置支付密码验证码错误',
                                '40137' => '验证码错误',
                                '40038' => '图片ID必须',
				'40039' => '支付密码错误',
				'40040' => '余额不足',
				
				//营销相关
				'40041'	=> '优惠码已经被领取',
				'40042'	=> '当前类型优惠码已过期',
				'40043'	=> '优惠码ID必须',
				'40044'	=> '当前优惠码未被领取，无法查看详情',
				'40045'	=> '优惠码必须',
		
				//参数相关
				'40051'	=> '用户ID必须',
                                '40052'	=> '极光用户设备ID必须',
				//收藏
				'40061'	=> '目标ID必须',
				'40062'	=> '类型编号必须',
				'40063'	=> '当前目标ID已存在',
				'40064'	=> '目标ID不存在',
				'40065'	=> '目标ID必须',
				'40066'	=> '未取得对应目标ID',
				'40067'	=> '关联类型编码必须',
				'40068'	=> '关联类型编码有误',
		
				//购物车
				'40071'	=> '购物车商品类型必须',
				'40072'	=> '购物车商品增减/修改数量必须',
				'40073'	=> '票组Key必须',
				'40074'	=> '票组Sign必须',
				'40075'	=> '票组Key与票组Sign不匹配',
				'40076'	=> '目标商品ID必须',
				'40077'	=> '结算商品KEY必须',
				'40078'	=> '库存不足',
		
				//收货地址
				'40081'	=> '收货人名称必须',
				'40082'	=> '收货人省份必须',
				'40083'	=> '收货人城市必须',
				'40084'	=> '收货人详细收货地址必须',
				'40085'	=> '收货人手机必须',
				'40086'	=> '收货地址ID必须',
				'40087'	=> '收货地址必须',
		
				//提交订单
				'40091'	=> '配送方式ID必须',
				'40092'	=> '支付方式必须',
				'40093'	=> '票商ID必须',
				'40094'	=> '生成订单组生成失败',
				'40095'	=> '单个订单生成失败',
				'40096'	=> '订单票类型记录失败',
				'40097'	=> '卖家库存不足',
				'40098'	=> '订单关联优惠券失败',
				'40099'	=> '订单组金额更新失败',
				'40100'	=> '票商ID无法匹配到购物车商品票商',
				'40101'	=> '配送地址不存在',
				'40102'	=> '支付密码必须',
				'40103'	=> '优惠券不存在或已使用',
				'40104'	=> '组订单已成功支付，无法取消',
				'40105'	=> '组订单存在已支付订单，无法取消',
				'40106'	=> '支付失败',
				'40107'	=> '当前订单已支付成功',
                                
				
		
				

						
				//用户订单
				'42001'	=> '用户订单ID必须',
				'42002'	=> '用户订单取消失败',
				'42003'	=> '订单已过期',
				'42004'	=> '配送公司名称必须',
				'42005'	=> '配送快递单号',
				'42006'	=> '当前订单已经评论过',
				'42007'	=> '评论UID非下单用户UID',
				'42008'	=> '当前订单未完成支付，不可评论',
				'42009'	=> '申请退款原因必须',
				'42010'	=> '用户订单确认退款失败',
				'42011'	=> '拒绝退款原因必须',
                                '42012' => '订单类型必须',
		    '42014' => '订单状态必须',
				//意见反馈
				'43001' => '反馈内容必须',
				'43002' => '反馈用户联系方式必须',

				

				//兴趣分类
				'43103'=>'当前用户不存在',

				//内容配置
				'43110'=>'内容配置名称必须',
				'43111'=>'内容配置不存在',

				

				//用户兴趣分类
				'44001'=>'用户兴趣分类必须',
				'44002'=>'用户兴趣分类已存在',
				'44003'=>'兴趣分类不存在',
				//收入，支出
				'44010'=>'收入支出方式必须',
				'44011'=>'收入支出方式错误',

				'44021'=>'提现金额必须',
				'44022'=>'提现金额格式错误',
				'44023'=>'提现金额超出当前余额',
				'44024'=>'提现卡类型必须',
				'44025'=>'提现卡账户必须',
				'44026'=>'支付密码必须',
				'44027'=>'支付密码错误',
				'44028'=>'提现失败',
				'44029'=>'充值金额必须',
				'44030'=>'充值金额格式错误',
				'44031'=>'提现金额有误',
				'44032'=>'充值金额有误',
				'44033'=>'充值失败',
                                '44034'=>'提现姓名必须',
                                '44035'=>'银行ID必须',
                                '44036'=>'姓名必须',
                                '44037'=>'账户必须',
                                '44038'=>'银行卡ID必须',
				

				//发送验证码
				'44060'=>'手机号已存在',
				'44061'=>'手机号不存在',
				'44062'=>'此手机号已经绑定第三方，请先解除在绑定',
                                '50010' => '短信发送失败',
                    
                                //完善用户信息
                                '44070' =>'信息不能为空',
            	'50011' => '短信平台接口错误',
            	'50012' => '短信操作过于频繁',
                 //投票
                 '44071'=> '您已投票',
                 //专题
                 '60001'=>'专题类型不能为空',
                 '60002'=>'专题ID必须',
                 //商品
                 '60011'=>'商品使用类型不能为空',
                 //积分
                  '60021'=>'积分不足',
                  '60022'=>'积分类型不能为空',
                 //注册
                    '40138'=>'用户类型不能为空',
                    '40139'=>'专业类型不能为空',
                    '40140'=>'手机格式不正确',
                 //实名认证
                    '40141'=>'身份证正面不能为空',
                    '40142'=>'身份证背面不能为空',
                    '40143'=>'执业医师证/执业护士证 不能为空',
                    '40144'=>'医师资格证/护士资格证 不能为空',
                    '40145'=>'营养师/康复师/心理咨询师资格证书 不能为空',
                    '40146'=>'个人专长图片不能为空',
                    '40147'=>'个人专长视频不能为空',
                    '40148'=>'产品合格证不能为空',
                    '40149'=>'产品图片不能为空',
                    '40150'=>'营业执照不能为空',
                    '40151'=>'资格证书不能为空',
                    '40152'=>'机构证书不能为空',
                  //资讯
                    '45001'=>'请选择图片',
                    '45002'=>'资讯ID不能为空',
                    '45003'=>'资讯标题不能为空',
                    '45004'=>'资讯分类不能为空',
                    '45005'=>'资讯封面图不能为空',
                    '45006'=>'段落ID不能为空',
                    '45007'=>'顺序类型不能为空',
                    '45008'=>'后一位段落ID不能为空',
                  //公共
                    '46001'=>'目标类型不能为空',
                    '46002'=>'目标ID不能为空',
                    '46003'=>'分类不能为空',
                    '46004'=>'标题不能为空',
                    '46005'=>'内容不能为空',
                    '46006'=>'金额不能为空',
                    '46007'=>'顶级ID必须',
                    '46008'=>'类型不能为空',
                  //评论
                    '47001'=>'评论内容不能为空',
                  //举报
                    '48001'=>'举报类型不能为空',
                  //视频
                    '49001'=>'请上传视频',
                    '49002'=>'视频ID不能为空',
                    '49003'=>'上传类型不能为空',
                    '49004'=>'视频封面不能为空',
                    '49005'=>'上传文件类型不能为空',
                   //个人信息
                    '50001'=>'简介内容不能为空',
                    '50002'=>'擅长内容不能为空',
                   //搜索
                    '51001'=>'搜索关键字不能为空',
                    //课程
                    '52001'=>'课程类型不能为空',
                    '52002'=>'课程ID必须',
                    '52003'=>'课时ID必须',
                    //问询
                    '53001'=>'问询类型必须',
                    '53002'=>'问询价格必须',
                    '53003'=>'问询日期必须',
                    '53004'=>'开始时间必须',
                    '53005'=>'结束时间必须',
                    '53006'=>'问询对象UID必须',
                    '53007'=>'问询时间ID必须',
                    '53008'=>'问询ID必须',
                    '53009'=>'时间json必须',
                    //直播
                    '54001'=>'请选择直播时间',
                    '54002'=>'直播封面不能为空',
                    '54003'=>'直播介绍不能为空',
                    '54004'=>'直播ID必须',
                    
                ),
);